CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/src/gd32a50x_fmc.c
    /* get EFALC & EPSIZE value in option bytes 1 */
    value = FMC_OB1CS & FMC_OB1CS_EFALC;
    value |= FMC_OB1CS & FMC_OB1CS_EPSIZE;

    switch(value) {
    case OB1CS_DF_64K:
        dflash_size = 64U * 0x400U;
        break;
    case OB1CS_DF_INVALID:
        dflash_size = 0xFFFFFFFFU;
        break;
    case OB1CS_DF_32K:
        dflash_size = 32U * 0x400U;
        break;
    case OB1CS_DF_16K:
        dflash_size = 16U * 0x400U;
        break;
    default:
        break;
    }

    return dflash_size;
}

/*!
    \brief      get FMC flag status
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_BANK0_FLAG_BUSY: flash bank0 busy flag
      \arg        FMC_BANK0_FLAG_PGSERR: flash bank0 program sequence error flag
      \arg        FMC_BANK0_FLAG_PGERR: flash bank0 program error flag
      \arg        FMC_BANK0_FLAG_PGAERR: flash bank0 program alignment error flag
      \arg        FMC_BANK0_FLAG_WPERR: flash bank0 erase/program protection error flag
      \arg        FMC_BANK0_FLAG_END: flash bank0 end of operation flag
      \arg        FMC_BANK0_FLAG_CBCMDERR: flash bank0 checked area by the check blank command is all 0xFF or not flag
      \arg        FMC_BANK0_FLAG_RSTERR: flash bank0 BOR/POR or system reset during erase/program flag
      \arg        FMC_BANK1_FLAG_BUSY: flash bank1 busy flag
      \arg        FMC_BANK1_FLAG_PGSERR: flash bank1 program sequence error flag
      \arg        FMC_BANK1_FLAG_PGERR: flash bank1 program error flag
      \arg        FMC_BANK1_FLAG_PGAERR: flash bank1 program alignment error flag
      \arg        FMC_BANK1_FLAG_WPERR: flash bank1 erase/program protection error flag
      \arg        FMC_BANK1_FLAG_END: flash bank1 end of operation flag
      \arg        FMC_BANK1_FLAG_CBCMDERR: flash bank1 checked area by the check blank command is all 0xFF or not flag
      \arg        FMC_BANK1_FLAG_RSTERR: flash bank1 BOR/POR or system reset during erase/program flag
      \arg        FMC_FLAG_OB0ECC: an ECC bit error is detected in option byte 0 flag
      \arg        FMC_FLAG_BK1ECC: an ECC bit error is detected in bank 1 flag
      \arg        FMC_FLAG_SYSECC: an ECC bit error is detected in system memory flag
      \arg        FMC_FLAG_DFECC: an ECC bit error is detected in data flash flag
      \arg        FMC_FLAG_OTPECC: an ECC bit error is detected in OTP flag
      \arg        FMC_FLAG_OB1ECCDET: option bytes 1 two bit error detect flag
      \arg        FMC_FLAG_OB0ECCDET: option bytes 0 two bit error detect flag
      \arg        FMC_FLAG_ECCCOR: one bit error detected and correct flag
      \arg        FMC_FLAG_ECCDET: OTP/data flash/system memory/bank1 two bit error detect flag
      \arg        FMC_FLAG_OBERR: option bytes 0 error flag
      \arg        FMC_FLAG_OB1ERR: option bytes 1 read error flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_flag_get(fmc_flag_enum flag)
{
    /* get FMC flag */
    if(0U != (FMC_REG_VAL(flag) & BIT(FMC_BIT_POS(flag)))) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear FMC flag status
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_BANK0_FLAG_PGSERR: flash bank0 program sequence error flag
      \arg        FMC_BANK0_FLAG_PGERR: flash bank0 program error flag
      \arg        FMC_BANK0_FLAG_PGAERR: flash bank0 program alignment error flag
      \arg        FMC_BANK0_FLAG_WPERR: flash bank0 erase/program protection error flag
      \arg        FMC_BANK0_FLAG_END: flash bank0 end of operation flag
      \arg        FMC_BANK0_FLAG_CBCMDERR: flash bank0 checked area by the check blank command is all 0xFF or not flag
      \arg        FMC_BANK0_FLAG_RSTERR: flash bank0 BOR/POR or system reset during erase/program flag
      \arg        FMC_BANK1_FLAG_PGSERR: flash bank1 program sequence error flag
      \arg        FMC_BANK1_FLAG_PGERR: flash bank1 program error flag
      \arg        FMC_BANK1_FLAG_PGAERR: flash bank1 program alignment error flag
      \arg        FMC_BANK1_FLAG_WPERR: flash bank1 erase/program protection error flag
      \arg        FMC_BANK1_FLAG_END: flash bank1 end of operation flag
      \arg        FMC_BANK1_FLAG_CBCMDERR: flash bank1 checked area by the check blank command is all 0xFF or not flag
      \arg        FMC_BANK1_FLAG_RSTERR: flash bank1 BOR/POR or system reset during erase/program flag
      \arg        FMC_FLAG_OB1ECCDET: option bytes 1 two bit error detect flag
      \arg        FMC_FLAG_OB0ECCDET: option bytes 0 two bit error detect flag
      \arg        FMC_FLAG_ECCCOR: one bit error detected and correct flag
      \arg        FMC_FLAG_ECCDET: OTP/data flash/system memory/bank1 two bit error detect flag
    \param[out] none
    \retval     none
*/
void fmc_flag_clear(fmc_flag_enum flag)
{
    uint32_t reg_offset, reg;

    reg_offset = ((uint32_t)(flag) & 0x0000FFFFU) >> 6U;
    /* clear the flags in ECCCS register */
    if(ECCCS_REG_OFFSET == reg_offset) {
        reg = FMC_REG_VAL(flag);
        reg &= ~ECCCS_FLAG_MASK;
        reg |= BIT(FMC_BIT_POS(flag));
        FMC_REG_VAL(flag) = reg;
    } else {
        /* clear the flags in STAT0/STAT1 register */
        FMC_REG_VAL(flag) = BIT(FMC_BIT_POS(flag));
    }
}

/*!
    \brief      enable FMC interrupt
    \param[in]  interrupt: the FMC interrupt source
                only one parameter can be selected which is shown as below:
      \arg        FMC_BANK0_INT_ERR: FMC bank0 error interrupt
      \arg        FMC_BANK0_INT_END: FMC bank0 end of operation interrupt
      \arg        FMC_BANK1_INT_ERR: FMC bank1 error interrupt
      \arg        FMC_BANK1_INT_END: FMC bank1 end of operation interrupt
      \arg        FMC_INT_ECCCOR: FMC one bit error correct interrupt
      \arg        FMC_INT_ECCDET: FMC two bits error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_enable(fmc_interrupt_enum interrupt)
{
    uint32_t reg_offset, reg;

    reg_offset = ((uint32_t)(interrupt) & 0x0000FFFFU) >> 6U;
    /* enable interrupt in ECCCS register */
    if(ECCCS_REG_OFFSET == reg_offset) {
        reg = FMC_REG_VAL(interrupt);
        reg &= ~ECCCS_FLAG_MASK;
        reg |= BIT(FMC_BIT_POS(interrupt));
        FMC_REG_VAL(interrupt) = reg;
    } else {
        /* enable interrupt in CTL0/CTL1 register */
        FMC_REG_VAL(interrupt) |= BIT(FMC_BIT_POS(interrupt));
    }
}

/*!
    \brief      disable FMC interrupt
    \param[in]  interrupt: the FMC interrupt source
                only one parameter can be selected which is shown as below:
      \arg        FMC_BANK0_INT_ERR: FMC bank0 error interrupt
      \arg        FMC_BANK0_INT_END: FMC bank0 end of operation interrupt
      \arg        FMC_BANK1_INT_ERR: FMC bank1 error interrupt
      \arg        FMC_BANK1_INT_END: FMC bank1 end of operation interrupt
      \arg        FMC_INT_ECCCOR: FMC one bit error correct interrupt
      \arg        FMC_INT_ECCDET: FMC two bits error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_disable(fmc_interrupt_enum interrupt)
{
    uint32_t reg_offset, reg;

    reg_offset = ((uint32_t)(interrupt) & 0x0000FFFFU) >> 6U;
    /* disable interrupt in ECCCS register */
    if(ECCCS_REG_OFFSET == reg_offset) {
        reg = FMC_REG_VAL(interrupt);
        reg &= ~ECCCS_FLAG_MASK;
        reg &= ~BIT(FMC_BIT_POS(interrupt));
        FMC_REG_VAL(interrupt) = reg;
    } else {
        /* disable interrupt in CTL0/CTL1 register */
        FMC_REG_VAL(interrupt) &= ~BIT(FMC_BIT_POS(interrupt));
    }
}

/*!
    \brief      get FMC interrupt flag status
    \param[in]  flag: FMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_BANK0_INT_FLAG_PGSERR: flash bank0 program sequence error intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_PGERR: flash bank0 program error intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_PGAERR: flash bank0 program alignment error intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_WPERR: flash bank0 erase/program protection error intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_END: flash bank0 end of operation intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_CBCMDERR: flash bank0 checked area by the check blank command is all 0xFF or not intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_RSTERR: flash bank0 BOR/POR or system reset during erase/program intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_PGSERR: flash bank1 program sequence error intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_PGERR: flash bank1 program error intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_PGAERR: flash bank1 program alignment error intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_WPERR: flash bank1 erase/program protection error intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_END: flash bank1 end of operation intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_CBCMDERR: flash bank1 checked area by the check blank command is all 0xFF or not intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_RSTERR: flash bank1 BOR/POR or system reset during erase/program intrrupt flag
      \arg        FMC_INT_FLAG_OB1ECCDET: option bytes 1 two bit error detect intrrupt flag
      \arg        FMC_INT_FLAG_OB0ECCDET: option bytes 0 two bit error detect intrrupt flag
      \arg        FMC_INT_FLAG_ECCCOR: one bit error detected and correct intrrupt flag
      \arg        FMC_INT_FLAG_ECCDET: OTP/data flash/system memory/bank1 two bit error detect intrrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_interrupt_flag_get(fmc_interrupt_flag_enum int_flag)
{
    uint32_t intenable = 0U, flagstatus = 0U;
    /* get the interrupt enable bit status */
    intenable = (FMC_REG_VAL(int_flag) & BIT(FMC_BIT_POS(int_flag)));
    /* get the corresponding flag bit status */
    flagstatus = (FMC_REG_VAL2(int_flag) & BIT(FMC_BIT_POS2(int_flag)));

    if(flagstatus && intenable) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear FMC interrupt flag status
    \param[in]  flag: FMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_BANK0_INT_FLAG_PGSERR: flash bank0 program sequence error intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_PGERR: flash bank0 program error intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_PGAERR: flash bank0 program alignment error intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_WPERR: flash bank0 erase/program protection error intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_END: flash bank0 end of operation intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_CBCMDERR: flash bank0 checked area by the check blank command is all 0xFF or not intrrupt flag
      \arg        FMC_BANK0_INT_FLAG_RSTERR: flash bank0 BOR/POR or system reset during erase/program intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_PGSERR: flash bank1 program sequence error intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_PGERR: flash bank1 program error intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_PGAERR: flash bank1 program alignment error intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_WPERR: flash bank1 erase/program protection error intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_END: flash bank1 end of operation intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_CBCMDERR: flash bank1 checked area by the check blank command is all 0xFF or not intrrupt flag
      \arg        FMC_BANK1_INT_FLAG_RSTERR: flash bank1 BOR/POR or system reset during erase/program intrrupt flag
      \arg        FMC_INT_FLAG_OB1ECCDET: option bytes 1 two bit error detect intrrupt flag
      \arg        FMC_INT_FLAG_OB0ECCDET: option bytes 0 two bit error detect intrrupt flag
      \arg        FMC_INT_FLAG_ECCCOR: one bit error detected and correct intrrupt flag
      \arg        FMC_INT_FLAG_ECCDET: OTP/data flash/system memory/bank1 two bit error detect intrrupt flag
    \param[out] none
    \retval     none
*/
void fmc_interrupt_flag_clear(fmc_interrupt_flag_enum int_flag)
{
    uint32_t reg_offset, reg;

